import os

API_TOKEN = os.environ.get('BOT_TOKEN')
ADMIN_ID = int(os.environ.get('ADMIN_ID', 0))

MIN_PLAYERS = 2

CHANNEL_USERNAME = os.getenv('CHANNEL_USERNAME', '@dimbub')
CHANNEL_URL = os.getenv('CHANNEL_URL', 'https://t.me/dimbub')
CHANNEL_ID = int(os.getenv('CHANNEL_ID', '-1003369490880'))

THEMES = {
    'dota2': [
        "Pudge", "Invoker", "Juggernaut", "Lina", "Crystal Maiden", "Anti-Mage",
        "Axe", "Zeus", "Slark", "Phantom Assassin", "Terrorblade", "Sven",
        "Tiny", "Mirana", "Windranger", "Riki", "Bounty Hunter", "Ursa",
        "Shadow Fiend", "Templar Assassin", "Ember Spirit", "Storm Spirit",
        "Earth Spirit", "Io", "Chen", "Enchantress", "Meepo", "Arc Warden",
        "Techies", "Rubick", "Dark Willow", "Monkey King", "Mars", "Void Spirit",
        "Dawnbreaker", "Marci", "Primal Beast", "Muerta", "Drow Ranger", "Luna",
        "Medusa", "Naga Siren", "Phantom Lancer", "Razor", "Spectre", "Troll Warlord",
        "Viper", "Weaver", "Necrophos", "Queen of Pain", "Tinker"
    ],
    
    'clashroyale': [
        "Рыцарь", "Лучники", "Ведьма", "Принц", "Голем", "Пекка", "Гигант",
        "Лава-щенок", "Минер", "Баллон", "Волшебник", "Стрелок", "Мега-рыцарь",
        "Электро-дракон", "Ледяной дух", "Огненный дух", "Хог Райдер", 
        "Королева лучников", "Король-скелет", "Принцесса", "Ледяной голем",
        "Лава-гончая", "Бэби-дракон", "Валькирия", "Охотник за головами",
        "Тёмный принц", "Банда скелетов", "Ведьма-лекарь", "Электрический дух",
        "Ледяная ведьма", "Огненная собака", "Магнит", "Пекарь", "Каньонир",
        "Гоблинская бочка", "Летающий котел", "Летающий дракон", "Зомби",
        "Призрак", "Скелет-дракон", "Мини-пекка", "Гигантский скелет",
        "Трёхглавый дракон", "Колдун", "Ниндзя", "Пирамида", "Робот",
        "Супер-минион", "Танк", "Варвар"
    ],
    
    'brawlstars': [
        "Шэлли", "Кольт", "Булл", "Брок", "Эль Примо", "Роза", "Леон", "Спайк",
        "Кроу", "Джесси", "Нита", "Динамик", "Тик", "8-Бит", "Эмз", "Стью",
        "Поко", "Фрэнк", "Пенни", "Дэррил", "Карл", "Джекки", "Гейл", "Нанни",
        "Эдгар", "Байрон", "Гром", "Грифф", "Белл", "Эш", "Мэг", "Лола", "Фэнг",
        "Ева", "Джанет", "Отис", "Сэм", "Гас", "Бонни", "Честер", "Грей", "Мэнди",
        "Р-T", "Уиллоу", "Дуг", "Чак", "Мэйси", "Перл", "Ларри и Лори", "Хэнк"
    ],
    
    'locations': [
        "Больница", "Ресторан", "Школа", "Тюрьма", "Космическая станция",
        "Банк", "Супермаркет", "Аэропорт", "Отель", "Кинотеатр", "Театр",
        "Музей", "Библиотека", "Спортзал", "Бассейн", "Пляж", "Горнолыжный курорт",
        "Зоопарк", "Парк развлечений", "Церковь", "Торговый центр", "Стадион",
        "Подводная лодка", "Пустыня", "Джунгли", "Горы", "Пещера", "Замок",
        "Деревня", "Город", "Ферма", "Лаборатория", "Фабрика", "Строительная площадка",
        "Кладбище", "Остров", "Вокзал", "Метро", "Автобус", "Самолёт", "Корабль",
        "Поезд", "Такси", "Кафе", "Бар", "Ночной клуб", "Спа  салон", "Парикмахерская",
        "Сауна", "Боулинг"
    ]
}