import os

API_TOKEN = os.environ.get('BOT_TOKEN')
ADMIN_ID = int(os.environ.get('ADMIN_ID', 0))

MIN_PLAYERS = 2

CHANNEL_USERNAME = os.getenv('CHANNEL_USERNAME', '@dimbub')
CHANNEL_URL = os.getenv('CHANNEL_URL', 'https://t.me/dimbub')
CHANNEL_ID = int(os.getenv('CHANNEL_ID', '-1003369490880'))

THEMES = {
    'dota2': [
        "Pudge", "Invoker", "Juggernaut", "Lina", "Crystal Maiden", "Anti-Mage",
        "Axe", "Zeus", "Slark", "Phantom Assassin", "Terrorblade", "Sven",
        "Tiny", "Mirana", "Windranger", "Riki", "Bounty Hunter", "Ursa",
        "Shadow Fiend", "Templar Assassin", "Ember Spirit", "Storm Spirit",
        "Earth Spirit", "Io", "Chen", "Enchantress", "Meepo", "Arc Warden",
        "Techies", "Rubick", "Dark Willow", "Monkey King", "Mars", "Void Spirit",
        "Dawnbreaker", "Marci", "Primal Beast", "Muerta", "Drow Ranger", "Luna",
        "Medusa", "Naga Siren", "Phantom Lancer", "Razor", "Spectre", "Troll Warlord",
        "Viper", "Weaver", "Necrophos", "Queen of Pain", "Tinker"
    ],
    
    'clashroyale': [
        "Рыцарь", "Лучницы", "Ведьма", "Принц", "Голем", "Пекка", "Гигант",
        "Волар ББ", "Шахтер", "Шар", "Огненный маг", "Мушкетка", "Мега-рыцарь",
        "Электро-дракон", "Ледяной дух", "Огненный дух", "Хог Райдер", 
        "Королева лучниц", "Король-скелетов", "Принцесса", "Ледяной голем",
        "Бревно", "Дракончик", "Валькирия", "Охотник",
        "Тёмный принц ВУХАХАХА", "Армия скелетов", "Целительница", "Электрический дух",
        "Ледяной клоун", "Феникс", "Спарки", "Пекарь", "Канонир",
        "Гоблинская бочка", "Королевская почта", "Пламенный дракон", "Кладбище",
        "Королевский дух", "Костяные драконы", "Мини-пекка", "Гигантский скелет",
        "Императрица духов", "Громовержец", "Бандитка", "Хижина гоблинов", "Гоблинская машина",
        "Мега минон", "Электро-гигант", "Варвары", "Старина канье вест"
    ],
    
    'brawlstars': [
        "Шэлли", "Кольт", "Булл", "Брок", "Эль Примо", "Роза", "Леон", "Спайк",
        "Кроу", "Джесси", "Нита", "Диномайк", "Тик", "8-Бит", "Эмз", "Гасс",
        "Поко", "Фрэнк", "Пенни", "Дэррил", "Карл", "Джекки", "Гейл", "Нанни",
        "Эдгар", "Байрон", "Гром", "Грифф", "Белль", "Эш", "Мэг", "Лола", "Фэнг",
        "Ева", "Джанет", "Отис", "Сэм", "Коллет", "Бонни", "Честер", "Грей", "Мэнди",
        "Р-T", "Кадзе", "Кит", "Чак", "Мэйси", "Перл", "Ларри и Лори", "Хэнк", "Старина канье вест"
    ],
    
    'locations': [
        "Больница", "Ресторан", "Школа", "Тюрьма", "Космическая станция",
        "Банк", "Супермаркет", "Аэропорт", "Отель", "Кинотеатр", "Театр",
        "Музей", "Библиотека", "Спортзал", "Бассейн", "Пляж", "Горнолыжный курорт",
        "Зоопарк", "Парк развлечений", "Церковь", "Торговый центр", "Стадион",
        "Подводная лодка", "Пустыня", "Джунгли", "Горы", "Пещера", "Замок",
        "Деревня", "Город", "Ферма", "Зомби-лаборатория", "Фабрика", "Строительная площадка",
        "Кладбище", "Остров", "Вокзал", "Метро", "Автобус", "Самолёт", "Корабль",
        "Поезд", "Такси", "Кафе", "Бар", "Ночной клуб", "Спа  салон", "Парикмахерская",
        "Сауна", "Боулинг", "морг", "Стрипуха", "Гей клуб", "Хата бабушки ведущего"
    ]
}